
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Запись.Подразделение) Тогда
		ВКМ_ВидимостьПроцента();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Подразделение) Тогда
		ВКМ_ВидимостьПроцента();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ВидимостьПроцента()

	Если Запись.Подразделение = Справочники.ВКМ_Подразделения.Специалист Тогда
		Элементы.ПроцентОтРабот.Видимость = Истина;
	Иначе
		Элементы.ПроцентОтРабот.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти