#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьРеализации(ДатаНачала, ДатаОкончания) Экспорт
	
	Выборка = ПолучитьДанныеДоговоров(ДатаНачала, ДатаОкончания);
	
	ВсегоДоговоров = Выборка.Количество();
	
	ТекДог = 1;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Реализация = 0 Тогда
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйДокумент, Выборка);
			НовыйДокумент.Дата = ДатаНачала;
			
			НовыйДокумент.ВыполнитьАвтозаполнение();
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			ПроцентВыполнения = (ТекДог/ВсегоДоговоров)*100;
			ПроцентВыполнения = Окр(ПроцентВыполнения, 0);
		
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СокрЛП(Выборка.Договор)); 
			
			ТекДог = ТекДог + 1;			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДоговоров(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ЕСТЬNULL(ВКМ_ОбработкаАктовОбороты.Акт, 0) КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ОбработкаАктов.Обороты(&НачалоПериода, &КонецПериода,,) КАК
		|			ВКМ_ОбработкаАктовОбороты
		|		ПО ДоговорыКонтрагентов.Ссылка = ВКМ_ОбработкаАктовОбороты.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И (ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора МЕЖДУ &НачалоПериода И &КонецПериода
		|	ИЛИ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора <= &НачалоПериода)
		|	И (ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора МЕЖДУ &НачалоПериода И &КонецПериода
		|	ИЛИ ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора >= &КонецПериода)";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

#КонецЕсли