
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ДобавитьРеквизитыАбонДоговораНаФорму()	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВКМ_ДобавитьРеквизитыАбонДоговораНаФорму()

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьРеквизитыАбонДоговораНаФорму()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ДобавитьНовыеЭлементы();

	Иначе
		ГруппаДоговор = Элементы.Найти("ВКМ_ГруппаАбонентскийДоговор");
		Если ГруппаДоговор = Неопределено Тогда
			Возврат;
		Иначе
			Элементы.Удалить(ГруппаДоговор);
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	
	ГруппаАбонентскийДоговор = Элементы.Добавить("ВКМ_ГруппаАбонентскийДоговор", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаАбонентскийДоговор.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонентскийДоговор.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаАбонентскийДоговор.ОтображатьЗаголовок = Ложь;
	ГруппаАбонентскийДоговор.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ГруппаДатыДоговора = Элементы.Добавить("ВКМ_ГруппаДатыДоговора", Тип("ГруппаФормы"), ГруппаАбонентскийДоговор);
	ГруппаДатыДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДатыДоговора.Заголовок = "Период действия договора";
	ГруппаДатыДоговора.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаДатыДоговора.ОтображатьЗаголовок = Истина;
	ГруппаДатыДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачалаДоговора", Тип("ПолеФормы"), ГруппаДатыДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "с";
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДоговора";

	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончанияДоговора", Тип("ПолеФормы"), ГруппаДатыДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "по";
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДоговора";

	НовыйЭлемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаАбонентскийДоговор);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "СуммаАбонентскойПлаты";
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";

	НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"), ГруппаАбонентскийДоговор);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "СтоимостьЧаса";
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	
КонецПроцедуры

#КонецОбласти